In [1]:
import pandas as pd

df = pd.DataFrame( 
        {"a" : [4 ,5, 6], 
         "b" : [7, 8, 9], 
         "c" : [10, 11, 12]}
    ,    index = [1, 2, 3])

In [2]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [3]:
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [4]:
df["b"]

1    7
2    8
3    9
Name: b, dtype: int64

In [5]:
df[["c","a"]]

    c  a
1  10  4
2  11  5
3  12  6

In [6]:
df.loc[3]

a     6
b     9
c    12
Name: 3, dtype: int64

In [7]:
df.loc[3,"a"]

6

Kernel -> restart & clear output 을 하면 실행했던 결과들이 모두 사라진다.

In [9]:
df.loc[[1,2],["a"]]

   a
1  4
2  5

In [10]:
df = pd.DataFrame( 
        [[4, 7, 10], 
         [5, 8, 11], 
         [6, 9, 12]], 
        index=[1, 2, 3], 
        columns=['a', 'b', 'c'])

In [11]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

인덱스 2개

In [55]:
import numpy as np
df = pd.DataFrame( 
    {"a" : [4 ,5, 6,np.nan], 
     "b" : [7, np.nan, 9,9], 
     "c" : [10, 11, np.nan,12]},    
    index = pd.MultiIndex.from_tuples( [('d',1),('d',2),('e',2),('e',3)], 
    names=['n','v']))

In [56]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  NaN  11.0
e 2  6.0  9.0   NaN
  3  NaN  9.0  12.0

기본 인덱스 번호는 0부터 시작

In [14]:
df[df.Length > 7]

AttributeError: 'DataFrame' object has no attribute 'Length'

In [15]:
df[df.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [16]:
df[df.b < 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [17]:
df.a < 7

n  v
d  1    True
   2    True
e  2    True
Name: a, dtype: bool

In [21]:
df[df["c"] > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [25]:
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [26]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [30]:
df.drop_duplicates() 
# inplce = True 라는 속성을 줘야 중복 값이 제거 된다. 
# 이 속성이 없이 drop_duplicates()함수를 사용해도 원래의 데이타 프레임에는 영향이 없다.

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [32]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [33]:
df.drop_duplicates(inplace=True)

In [34]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [35]:
df.drop_duplicates?

In [40]:
df.drop_duplicates(keep='last',inplace=True)

In [41]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [42]:
df["a"] != 7

n  v
d  1    True
   2    True
e  3    True
Name: a, dtype: bool

In [45]:
df["b"] != 7

n  v
d  1    False
   2     True
e  2     True
   3     True
Name: b, dtype: bool

In [53]:
df.a.isin?

isin(values)의 파라미터 valeus는 set or list의 형태여야 한다.

In [50]:
df.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
   3    False
Name: a, dtype: bool

In [57]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False   True  False
e 2  False  False   True
  3   True  False  False

In [59]:
df['a'].isnull().sum()

1

In [60]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True  False   True
e 2   True   True  False
  3  False   True   True

In [63]:
df.notnull().sum()

a    3
b    3
c    3
dtype: int64

In [66]:
~df.a.notnull()
# ~ : not

n  v
d  1    False
   2    False
e  2    False
   3     True
Name: a, dtype: bool

In [67]:
df[df.b==7] and df[df.a==5]
# 데이터 프레임에서는 and 연산자 사용 못함. 대신에 &사용

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [68]:
df[df.b==7] & df[df.a==5]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN